# Chapter 2 
# User Guide
## 2.1 10 minutes to pandas
### 2.1.1 Object creation

In [1]:
import numpy as np
import pandas as pd

**Creating Series**

In [3]:
s = pd.Series(data=[1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

**Creating a DataFrame**

In [4]:
dates = pd.date_range(start="20200101", periods=6)
dates

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [5]:
df = pd.DataFrame(np.random.randn(6, 4), 
                  index = dates, 
                  columns = list("ABCD"))

df

                   A         B         C         D
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-05  1.890987  1.766174 -0.703336 -1.071512
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288

In [6]:
df2 = pd.DataFrame(data = {"A": 1., 
                          "B": pd.Timestamp('20130102'), 
                          "C": pd.Series(1, index = list(range(4)), dtype = "float32"), 
                          "D": np.array([3] * 4, dtype = 'int32'), 
                          "E": pd.Categorical(['test', 'train', 'test', 'train']), 
                          "F": 'foo'})

df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [7]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [8]:
df2.A

0    1.0
1    1.0
2    1.0
3    1.0
Name: A, dtype: float64

### 2.1.2 Viewing data

In [9]:
df.head()

                   A         B         C         D
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-05  1.890987  1.766174 -0.703336 -1.071512

In [10]:
df.tail(n = 3)

                   A         B         C         D
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-05  1.890987  1.766174 -0.703336 -1.071512
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288

In [11]:
df.index

DatetimeIndex(['2020-01-01', '2020-01-02', '2020-01-03', '2020-01-04',
               '2020-01-05', '2020-01-06'],
              dtype='datetime64[ns]', freq='D')

In [12]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [13]:
df.to_numpy()

array([[ 0.14484537, -0.14377451, -0.77770873, -0.39769089],
       [ 0.83045216,  0.06418243,  1.00724204,  0.76483589],
       [ 0.35945684,  0.19858989,  0.56347385,  0.46538141],
       [ 0.56327065,  0.32601284, -0.04422862, -0.29861596],
       [ 1.89098727,  1.76617368, -0.70333609, -1.07151224],
       [ 0.60805974, -0.98126302, -0.34578362, -0.66428834]])

> Note that this can be an expensive operation when your DataFrame has columns with different data types, which comes down to a fundamental difference between pandas and numpy: **Numpy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column**. When you call `DataFrame.to_numpy()` pandas will find the Numpy dtype that can hold all of the dtypes in the DataFrame. This may end up being `object`, which requires casting every value to a Python object.

In [14]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [15]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.732845  0.204987 -0.050057 -0.200315
std    0.613239  0.894499  0.712466  0.692466
min    0.144845 -0.981263 -0.777709 -1.071512
25%    0.410410 -0.091785 -0.613948 -0.597639
50%    0.585665  0.131386 -0.195006 -0.348153
75%    0.774854  0.294157  0.411548  0.274382
max    1.890987  1.766174  1.007242  0.764836

In [16]:
df.T

   2020-01-01  2020-01-02  2020-01-03  2020-01-04  2020-01-05  2020-01-06
A    0.144845    0.830452    0.359457    0.563271    1.890987    0.608060
B   -0.143775    0.064182    0.198590    0.326013    1.766174   -0.981263
C   -0.777709    1.007242    0.563474   -0.044229   -0.703336   -0.345784
D   -0.397691    0.764836    0.465381   -0.298616   -1.071512   -0.664288

**Sorting by axis**

In [17]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2020-01-01 -0.397691 -0.777709 -0.143775  0.144845
2020-01-02  0.764836  1.007242  0.064182  0.830452
2020-01-03  0.465381  0.563474  0.198590  0.359457
2020-01-04 -0.298616 -0.044229  0.326013  0.563271
2020-01-05 -1.071512 -0.703336  1.766174  1.890987
2020-01-06 -0.664288 -0.345784 -0.981263  0.608060

In [18]:
df.sort_index(axis = 0, ascending = False)

                   A         B         C         D
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288
2020-01-05  1.890987  1.766174 -0.703336 -1.071512
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691

**Sorting by values**

In [19]:
df.sort_values(by = list("ABCD"), 
              ascending = False, 
              axis = 0)

                   A         B         C         D
2020-01-05  1.890987  1.766174 -0.703336 -1.071512
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691

### 2.1.3 Selection

**Getting**

Selecting a single column, which yields a `Series`.

In [20]:
df['A']

2020-01-01    0.144845
2020-01-02    0.830452
2020-01-03    0.359457
2020-01-04    0.563271
2020-01-05    1.890987
2020-01-06    0.608060
Freq: D, Name: A, dtype: float64

In [21]:
df[0:3]

                   A         B         C         D
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381

In [22]:
df['20200101':'20200103']

                   A         B         C         D
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381

**Selection by label**

In [23]:
df.loc[dates[0]]

A    0.144845
B   -0.143775
C   -0.777709
D   -0.397691
Name: 2020-01-01 00:00:00, dtype: float64

In [24]:
df.loc[:, ["A", "B"]]

                   A         B
2020-01-01  0.144845 -0.143775
2020-01-02  0.830452  0.064182
2020-01-03  0.359457  0.198590
2020-01-04  0.563271  0.326013
2020-01-05  1.890987  1.766174
2020-01-06  0.608060 -0.981263

In [25]:
df.loc['20200101':'20200103', ["A", "B"]]

                   A         B
2020-01-01  0.144845 -0.143775
2020-01-02  0.830452  0.064182
2020-01-03  0.359457  0.198590

In [26]:
df.loc['20200101', ["A", "B"]]

A    0.144845
B   -0.143775
Name: 2020-01-01 00:00:00, dtype: float64

In [27]:
df.loc[dates[0], "A"] # a scalar value

0.14484537255759714

In [28]:
df.at[dates[0], 'A']

0.14484537255759714

**Selection by position**

In [29]:
df.iloc[3, :] # the third row

A    0.563271
B    0.326013
C   -0.044229
D   -0.298616
Name: 2020-01-04 00:00:00, dtype: float64

In [30]:
df.iloc[3:5, 0:2]

                   A         B
2020-01-04  0.563271  0.326013
2020-01-05  1.890987  1.766174

In [31]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2020-01-02  0.830452  1.007242
2020-01-03  0.359457  0.563474
2020-01-05  1.890987 -0.703336

In [32]:
df.iloc[1:3, :]

                   A         B         C         D
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381

In [33]:
df.iloc[:, 1:3]

                   B         C
2020-01-01 -0.143775 -0.777709
2020-01-02  0.064182  1.007242
2020-01-03  0.198590  0.563474
2020-01-04  0.326013 -0.044229
2020-01-05  1.766174 -0.703336
2020-01-06 -0.981263 -0.345784

In [34]:
df.iloc[1, 1]

0.06418243172360702

In [35]:
df.iat[1, 1] # more faster

0.06418243172360702

**Boolen indexing**

In [36]:
df[df["A"] > 0] # selection rows

                   A         B         C         D
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-04  0.563271  0.326013 -0.044229 -0.298616
2020-01-05  1.890987  1.766174 -0.703336 -1.071512
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288

In [37]:
df[df > 0] # select elements

                   A         B         C         D
2020-01-01  0.144845       NaN       NaN       NaN
2020-01-02  0.830452  0.064182  1.007242  0.764836
2020-01-03  0.359457  0.198590  0.563474  0.465381
2020-01-04  0.563271  0.326013       NaN       NaN
2020-01-05  1.890987  1.766174       NaN       NaN
2020-01-06  0.608060       NaN       NaN       NaN

In [38]:
df2 = df.copy()

df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691    one
2020-01-02  0.830452  0.064182  1.007242  0.764836    one
2020-01-03  0.359457  0.198590  0.563474  0.465381    two
2020-01-04  0.563271  0.326013 -0.044229 -0.298616  three
2020-01-05  1.890987  1.766174 -0.703336 -1.071512   four
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288  three

**Using the `isin()` method for filtering**

In [39]:
df2[df2['E'].isin(['two', 'four'])] # like boolen select

                   A         B         C         D     E
2020-01-03  0.359457  0.198590  0.563474  0.465381   two
2020-01-05  1.890987  1.766174 -0.703336 -1.071512  four

**Setting**

Setting a new column automatically aligns the data by the indexes.

In [40]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], 
              index=pd.date_range("20200101", periods=6))

s1

2020-01-01    1
2020-01-02    2
2020-01-03    3
2020-01-04    4
2020-01-05    5
2020-01-06    6
Freq: D, dtype: int64

In [41]:
df['F'] = s1
df

                   A         B         C         D  F
2020-01-01  0.144845 -0.143775 -0.777709 -0.397691  1
2020-01-02  0.830452  0.064182  1.007242  0.764836  2
2020-01-03  0.359457  0.198590  0.563474  0.465381  3
2020-01-04  0.563271  0.326013 -0.044229 -0.298616  4
2020-01-05  1.890987  1.766174 -0.703336 -1.071512  5
2020-01-06  0.608060 -0.981263 -0.345784 -0.664288  6

In [42]:
# setting value by label
df.at[dates[0], 'A'] = 0

In [43]:
# setting value by position
df.iat[0, 1] = 0

In [44]:
df.loc[:, 'D'] = np.array([5] * len(df))

In [45]:
df

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -0.777709  5  1
2020-01-02  0.830452  0.064182  1.007242  5  2
2020-01-03  0.359457  0.198590  0.563474  5  3
2020-01-04  0.563271  0.326013 -0.044229  5  4
2020-01-05  1.890987  1.766174 -0.703336  5  5
2020-01-06  0.608060 -0.981263 -0.345784  5  6

In [46]:
df2 = df.copy()

df2[df2 > 0] = -df2

In [47]:
df2

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -0.777709 -5 -1
2020-01-02 -0.830452 -0.064182 -1.007242 -5 -2
2020-01-03 -0.359457 -0.198590 -0.563474 -5 -3
2020-01-04 -0.563271 -0.326013 -0.044229 -5 -4
2020-01-05 -1.890987 -1.766174 -0.703336 -5 -5
2020-01-06 -0.608060 -0.981263 -0.345784 -5 -6

### 2.1.4 Missing data
pandas primarily uses the value `np.nan` to represent missing data. It is by default not included in computations.

Reindexing allows you to change/add/delete the index on a specific axis.

In [50]:
df1 = df.reindex(index = dates[0:4], 
                columns = list(df.columns) + ['E'])

df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -0.777709  5  1  1.0
2020-01-02  0.830452  0.064182  1.007242  5  2  1.0
2020-01-03  0.359457  0.198590  0.563474  5  3  NaN
2020-01-04  0.563271  0.326013 -0.044229  5  4  NaN

In [52]:
# drop any rows that have missing data
df1.dropna(axis = 0, how = "any")

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -0.777709  5  1  1.0
2020-01-02  0.830452  0.064182  1.007242  5  2  1.0

In [54]:
# filling missing data
df1.fillna(value = 5)

                   A         B         C  D  F    E
2020-01-01  0.000000  0.000000 -0.777709  5  1  1.0
2020-01-02  0.830452  0.064182  1.007242  5  2  1.0
2020-01-03  0.359457  0.198590  0.563474  5  3  5.0
2020-01-04  0.563271  0.326013 -0.044229  5  4  5.0

In [55]:
# get the boolen mask where values are `nan`
pd.isna(df1)

                A      B      C      D      F      E
2020-01-01  False  False  False  False  False  False
2020-01-02  False  False  False  False  False  False
2020-01-03  False  False  False  False  False   True
2020-01-04  False  False  False  False  False   True

In [56]:
df1.isna()

                A      B      C      D      F      E
2020-01-01  False  False  False  False  False  False
2020-01-02  False  False  False  False  False  False
2020-01-03  False  False  False  False  False   True
2020-01-04  False  False  False  False  False   True

### 2.1.5 Operations
**Stats**

Operations in general *exclude* missing data.

In [58]:
df.mean(axis = 0, skipna=True)

A    0.708704
B    0.228949
C   -0.050057
D    5.000000
F    3.500000
dtype: float64

In [61]:
df.mean(axis = 1, skipna=True)

2020-01-01    1.044458
2020-01-02    1.780375
2020-01-03    1.824304
2020-01-04    1.969011
2020-01-05    2.590765
2020-01-06    2.056203
Freq: D, dtype: float64

Operating with objects that have different dimensionality and need alignment. In addition, pandas automatically broadcasts along the specific dimension.

In [62]:
s = pd.Series(data=[1, 3, 5, np.nan, 6, 8], 
             index = dates).shift(2)

s

2020-01-01    NaN
2020-01-02    NaN
2020-01-03    1.0
2020-01-04    3.0
2020-01-05    5.0
2020-01-06    NaN
Freq: D, dtype: float64

In [64]:
df

                   A         B         C  D  F
2020-01-01  0.000000  0.000000 -0.777709  5  1
2020-01-02  0.830452  0.064182  1.007242  5  2
2020-01-03  0.359457  0.198590  0.563474  5  3
2020-01-04  0.563271  0.326013 -0.044229  5  4
2020-01-05  1.890987  1.766174 -0.703336  5  5
2020-01-06  0.608060 -0.981263 -0.345784  5  6

In [63]:
df.sub(s, axis = "index") # df subtraction of s, element-wise, column

                   A         B         C    D    F
2020-01-01       NaN       NaN       NaN  NaN  NaN
2020-01-02       NaN       NaN       NaN  NaN  NaN
2020-01-03 -0.640543 -0.801410 -0.436526  4.0  2.0
2020-01-04 -2.436729 -2.673987 -3.044229  2.0  1.0
2020-01-05 -3.109013 -3.233826 -5.703336  0.0  0.0
2020-01-06       NaN       NaN       NaN  NaN  NaN

**Apply**

In [69]:
df.apply(func = np.cumsum, axis = 1)

                   A         B         C         D          F
2020-01-01  0.000000  0.000000 -0.777709  4.222291   5.222291
2020-01-02  0.830452  0.894635  1.901877  6.901877   8.901877
2020-01-03  0.359457  0.558047  1.121521  6.121521   9.121521
2020-01-04  0.563271  0.889283  0.845055  5.845055   9.845055
2020-01-05  1.890987  3.657161  2.953825  7.953825  12.953825
2020-01-06  0.608060 -0.373203 -0.718987  4.281013  10.281013

In [70]:
df.apply(func = np.cumsum, axis = 0)

                   A         B         C   D   F
2020-01-01  0.000000  0.000000 -0.777709   5   1
2020-01-02  0.830452  0.064182  0.229533  10   3
2020-01-03  1.189909  0.262772  0.793007  15   6
2020-01-04  1.753180  0.588785  0.748779  20  10
2020-01-05  3.644167  2.354959  0.045442  25  15
2020-01-06  4.252227  1.373696 -0.300341  30  21

In [73]:
df.apply(func=lambda x: x.max() - x.min(), axis = 0)

A    1.890987
B    2.747437
C    1.784951
D    0.000000
F    5.000000
dtype: float64

**Histogramming**

In [76]:
s = pd.Series(data=np.random.randint(low = 0, high = 7, size = 10))
s

0    2
1    2
2    4
3    5
4    6
5    2
6    5
7    2
8    1
9    6
dtype: int64

In [77]:
s.value_counts()

2    4
6    2
5    2
4    1
1    1
dtype: int64

**String Methods**

Series is equipped with a set of string processing methods in the `str` attribute that make it easy to operate on each element of the array, as in the code snippet below. Note that pattern-matching in `str` generally uses `regular expressions` by default (and in some cases always uses them).

In [6]:
s = pd.Series(["A", "B", "C", "AaBa", "Baca", np.nan, "CABA", "dog", "cat"])

s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

### 2.1.6 Merge

**Concat**

pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join/merge-type operations.

In [8]:
# Concatenating pandas object together with `concat()` function

df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.933751 -0.006914  1.432171  0.272210
1 -0.893390  1.263876  0.012197 -1.937673
2 -0.197660  1.159206  0.733066 -0.009964
3 -0.604862  1.095017  2.349898  0.276506
4  0.703677  0.146458 -1.141689  1.048964
5  0.124962 -0.173963 -0.542422 -0.736801
6 -0.569692 -0.590525 -0.608432 -0.080859
7  0.647426  0.397761 -0.143085  0.602002
8  0.420576  0.450065 -0.093824  0.115422
9  0.387881 -0.894290  0.841659  0.365820

In [9]:
pieces = [df[:3], df[3:7], df[7:]]

pd.concat(pieces)

          0         1         2         3
0 -0.933751 -0.006914  1.432171  0.272210
1 -0.893390  1.263876  0.012197 -1.937673
2 -0.197660  1.159206  0.733066 -0.009964
3 -0.604862  1.095017  2.349898  0.276506
4  0.703677  0.146458 -1.141689  1.048964
5  0.124962 -0.173963 -0.542422 -0.736801
6 -0.569692 -0.590525 -0.608432 -0.080859
7  0.647426  0.397761 -0.143085  0.602002
8  0.420576  0.450065 -0.093824  0.115422
9  0.387881 -0.894290  0.841659  0.365820

Adding a column to a `DataFrame` is relatively fast. However, adding a row requires a copy, and may be expensive. We recommend passing a pre-built list of records to the `DataFrame` constructor instead of building a `DataFrame` by iteratively appending records to it.

**Join**

SQL stype merges.

In [11]:
left = pd.DataFrame({'key': ['foo', 'foo'], "lval": [1, 2]})

right = pd.DataFrame({'key': ['foo', 'foo'], 'rval': [4, 5]})

In [12]:
left

   key  lval
0  foo     1
1  foo     2

In [13]:
right

   key  rval
0  foo     4
1  foo     5

In [14]:
pd.merge(left, right, on = 'key')

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

### 2.1.7 Grouping

By "group by" we are referring to a process involving one or more of the following steps:  

- **Splitting** the data into groups based on some criteria  
- **Applying** a function to each group independently  
- **Combining** the results into a data structure

In [16]:
df = pd.DataFrame({"A": ['foo', 'bar', 'foo', 'bar', 
                         'foo', 'bar', 'foo', 'foo'], 
                  "B": ['one', 'one', 'two', 'three', 
                       "two", 'two', 'one', 'three'], 
                  "C": np.random.randn(8), 
                  "D": np.random.randn(8)})

df

     A      B         C         D
0  foo    one  0.026132 -0.096759
1  bar    one  0.000340  1.556241
2  foo    two  0.723206 -0.869582
3  bar  three -0.241671 -1.419725
4  foo    two  1.054606 -0.806847
5  bar    two  0.088915  0.616234
6  foo    one  1.164779  0.386057
7  foo  three -0.561880 -1.335498

In [18]:
df.groupby(by = "A").sum()

            C        D
A
bar -0.152416  0.75275
foo  2.406843 -2.72263

In [19]:
df.groupby(by = ["A", "B"]).sum()

                  C         D
A   B
bar one    0.000340  1.556241
    three -0.241671 -1.419725
    two    0.088915  0.616234
foo one    1.190911  0.289298
    three -0.561880 -1.335498
    two    1.777812 -1.676429

### 2.1.8 Reshaping

**Stack**

In [23]:
tuples = list(zip(*[['bar', 'bar', 'baz', 'baz', 
                    'foo', 'foo', 'qux', 'qux'], 
                   ['one', 'two', 'one', 'two', 
                   'one', 'two', 'one', 'two']]))

index = pd.MultiIndex.from_tuples(tuples, names = ['first', 'second'])
df = pd.DataFrame(np.random.randn(8, 2), index = index, columns = ["A", "B"])

df2 = df[:4]
df

                     A         B
first second
bar   one     0.744701  0.464770
      two     0.552034 -0.733883
baz   one    -0.972784 -1.426034
      two     0.237323  0.913657
foo   one    -0.345178 -0.762807
      two     0.377743 -1.883930
qux   one     1.041113 -0.482750
      two    -0.087230 -0.542104

In [24]:
df2

                     A         B
first second
bar   one     0.744701  0.464770
      two     0.552034 -0.733883
baz   one    -0.972784 -1.426034
      two     0.237323  0.913657

In [25]:
stacked = df2.stack()
stacked

first  second
bar    one     A    0.744701
               B    0.464770
       two     A    0.552034
               B   -0.733883
baz    one     A   -0.972784
               B   -1.426034
       two     A    0.237323
               B    0.913657
dtype: float64

In [30]:
stacked.unstack(level=1)

second        one       two
first
bar   A  0.744701  0.552034
      B  0.464770 -0.733883
baz   A -0.972784  0.237323
      B -1.426034  0.913657

In [31]:
stacked.unstack(level=0)

first          bar       baz
second
one    A  0.744701 -0.972784
       B  0.464770 -1.426034
two    A  0.552034  0.237323
       B -0.733883  0.913657

In [32]:
stacked.unstack(level=-1)

                     A         B
first second
bar   one     0.744701  0.464770
      two     0.552034 -0.733883
baz   one    -0.972784 -1.426034
      two     0.237323  0.913657

**Pivot tables**

In [33]:
df = pd.DataFrame({"A": ['one', 'one', 'two', 'three'] * 3, 
                  "B": ['A', "B", "C"] * 4, 
                  "C": ['foo', 'foo', 'foo', 'bar', 'bar', 'bar'] * 2, 
                  "D": np.random.randn(12), 
                  "E": np.random.randn(12)})
df

        A  B    C         D         E
0     one  A  foo -0.094929 -1.654520
1     one  B  foo  0.457173 -0.862266
2     two  C  foo -0.539994  0.144925
3   three  A  bar -1.095011  0.207427
4     one  B  bar  0.517030  0.787870
5     one  C  bar  0.759732  1.013724
6     two  A  foo  0.788950 -1.245250
7   three  B  foo -0.131102  1.591128
8     one  C  foo -0.397305 -1.384776
9     one  A  bar  0.536894 -0.008753
10    two  B  bar  0.392984  0.953310
11  three  C  bar -1.059015 -1.363221

In [35]:
pd.pivot_table(data = df, 
              values = "D", 
              index = ['A', 'B'], 
              columns = ['C'])

C             bar       foo
A     B
one   A  0.536894 -0.094929
      B  0.517030  0.457173
      C  0.759732 -0.397305
three A -1.095011       NaN
      B       NaN -0.131102
      C -1.059015       NaN
two   A       NaN  0.788950
      B  0.392984       NaN
      C       NaN -0.539994

### 2.1.9 Time series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications.

In [3]:
rng = pd.date_range('20120101', periods=100, freq = 'S')
ts = pd.Series(np.random.randint(0, 500, len(rng)), index = rng)

ts

2012-01-01 00:00:00    448
2012-01-01 00:00:01    351
2012-01-01 00:00:02    115
2012-01-01 00:00:03    256
2012-01-01 00:00:04    106
                      ...
2012-01-01 00:01:35    352
2012-01-01 00:01:36    391
2012-01-01 00:01:37    208
2012-01-01 00:01:38    257
2012-01-01 00:01:39     37
Freq: S, Length: 100, dtype: int64

In [6]:
ts.resample(rule = '5Min').sum()

2012-01-01    23827
Freq: 5T, dtype: int64

In [9]:
# time zone representation

rng = pd.date_range('20200306', periods=5, freq = "D")

ts = pd.Series(np.random.randn(len(rng)), index = rng)
ts

2020-03-06    0.515424
2020-03-07    0.202799
2020-03-08   -1.532178
2020-03-09   -1.518142
2020-03-10   -0.087555
Freq: D, dtype: float64

In [12]:
ts_utc = ts.tz_localize(tz = "UTC")
ts_utc

2020-03-06 00:00:00+00:00    0.515424
2020-03-07 00:00:00+00:00    0.202799
2020-03-08 00:00:00+00:00   -1.532178
2020-03-09 00:00:00+00:00   -1.518142
2020-03-10 00:00:00+00:00   -0.087555
Freq: D, dtype: float64

In [14]:
# converting to another time zone

ts_utc.tz_convert(tz = "US/Eastern")

2020-03-05 19:00:00-05:00    0.515424
2020-03-06 19:00:00-05:00    0.202799
2020-03-07 19:00:00-05:00   -1.532178
2020-03-08 20:00:00-04:00   -1.518142
2020-03-09 20:00:00-04:00   -0.087555
Freq: D, dtype: float64

## 2.2 Intro to data structures
### 2.2.1 Series

`Series` is a one-dimensional labeled array capable of holding any data type. The axis labels are collectively referred to as the **index**.

s = pd.Series(data, index)

**data** can be many different things:  
- a python dict
- an ndarray
- a scalar value (like 5)

The passed **index** is a list of axis labels. Thus, this separates into few cases depending on what **data is**

In [2]:
# ndarray

s = pd.Series(np.random.randn(5), 
              index = ['a', 'b', 'c', 'd', 'e'])
s

a   -0.776671
b   -0.354510
c   -1.149424
d    1.078744
e    0.266547
dtype: float64

In [3]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [4]:
pd.Series(np.random.randn(5))
# pandas supports non-unique index values.

0    2.325531
1    0.164460
2    0.638828
3    1.468596
4   -0.136669
dtype: float64

In [5]:
# dict

d = {'d': 1, 'a': 0, 'c': 2}
pd.Series(d)

d    1
a    0
c    2
dtype: int64

In [6]:
pd.Series(d, index = ['a', "d", 'c', "b"])

a    0.0
d    1.0
c    2.0
b    NaN
dtype: float64

In [7]:
# scalar value

pd.Series(5., index = ['a', 'b', 'c', 'd', 'e'])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

## Series is ndarray-like

Series acts very similarly to a ndarray, and is a valid argument to most NumPy functions.

In [8]:
s[0]

-0.7766711759418339

In [9]:
s[:3]

a   -0.776671
b   -0.354510
c   -1.149424
dtype: float64

In [10]:
s[s > s.median()]

d    1.078744
e    0.266547
dtype: float64

In [11]:
s[[4, 3, 1]]

e    0.266547
d    1.078744
b   -0.354510
dtype: float64

In [12]:
np.exp(s)

a    0.459935
b    0.701517
c    0.316819
d    2.940983
e    1.305449
dtype: float64

In [13]:
s.dtype

dtype('float64')

In [14]:
s.array

<PandasArray>
[-0.7766711759418339, -0.3545095563057308,  -1.149424140756993,
  1.0787438250213348,   0.266546944853899]
Length: 5, dtype: float64

In [16]:
s.to_numpy()

array([-0.77667118, -0.35450956, -1.14942414,  1.07874383,  0.26654694])

In [17]:
s['a']

-0.7766711759418339

In [18]:
s['e']

0.266546944853899

In [19]:
'e' in s

True

In [20]:
'f' in s

False

In [25]:
s.get('f', np.nan)

nan

In [26]:
s.get('a')

-0.7766711759418339

**Vectorized operations and label alignment with Series**

In [28]:
s + s

a   -1.553342
b   -0.709019
c   -2.298848
d    2.157488
e    0.533094
dtype: float64

In [29]:
s * 2

a   -1.553342
b   -0.709019
c   -2.298848
d    2.157488
e    0.533094
dtype: float64

In [30]:
np.exp(s)

a    0.459935
b    0.701517
c    0.316819
d    2.940983
e    1.305449
dtype: float64

In [31]:
s[1:] - s[:-1]

a    NaN
b    0.0
c    0.0
d    0.0
e    NaN
dtype: float64

**Name attribute**

In [32]:
s = pd.Series(np.random.randn(5), name = "something")
s

0    2.217585
1    1.745215
2    1.797496
3    1.608611
4   -0.333244
Name: something, dtype: float64

In [33]:
s2 = s.rename("different")
s2

0    2.217585
1    1.745215
2    1.797496
3    1.608611
4   -0.333244
Name: different, dtype: float64

### 2.2.2 DataFrame

**DataFrame** is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects. It is generally the most commonly used pandas object. Like Series, DataFrame accepts many different kinds of input:  

- Dict of 1D ndarrays, lists, dicts, or Series
- 2-D numpy.ndarray
- Structured or record ndarray
- A Series
- Another `DataFrame`  

Along with the data, you can optionally pass **index** (row labels) and **columns** (column labels) arguments. If you pass an index and / or columns, you are guaranteeing the index and / or columns of the resulting DatFrame. Thus, a dict of Series plus a specific index will discard all data not matching up to the passed index.

**From dict of Series or dicts**

The resulting **index** will be the **union** of the indexes of the various Series. If there are any nested dicts, these will first be converted to Series. If no columns are passed, the columns will be the ordered list of dict keys.

In [34]:
d = {"one": pd.Series([1, 2, 3], index = ['a', 'b', 'c']), 
    "two": pd.Series([1, 2, 3, 4], index = ['a', 'b', 'c', 'd'])}

df = pd.DataFrame(d)
df

   one  two
a  1.0    1
b  2.0    2
c  3.0    3
d  NaN    4

In [35]:
pd.DataFrame(d, index = ['d', 'b', 'a'])

   one  two
d  NaN    4
b  2.0    2
a  1.0    1

In [36]:
pd.DataFrame(d, index = ['d', 'b', 'a'], columns=['two', 'one'])

   two  one
d    4  NaN
b    2  2.0
a    1  1.0

In [37]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [38]:
df.columns

Index(['one', 'two'], dtype='object')

**From dict of ndarrays / lists**

The ndarrays must all be the same length. If an index is passed, it must clearly also be the same length as the arrays. If no index is passed, the result will be `range(n)`, where n is the array length.

In [39]:
d = {"one": [1, 2, 3, 4], 
    "two": [4, 3, 2, 1]}

pd.DataFrame(d)

   one  two
0    1    4
1    2    3
2    3    2
3    4    1

In [40]:
pd.DataFrame(d, index = ['a', 'b', 'c', 'd'])

   one  two
a    1    4
b    2    3
c    3    2
d    4    1

**From structured or record array**

In [43]:
data = np.zeros(shape = (2, ), dtype = [("A", 'i4'), ("B", 'f4'), ("C", 'a10')])
data[:] = [(1, 2, "Hello"), (2, 3, "World")]
data

array([(1, 2., b'Hello'), (2, 3., b'World')],
      dtype=[('A', '<i4'), ('B', '<f4'), ('C', 'S10')])

In [44]:
pd.DataFrame(data)

   A    B         C
0  1  2.0  b'Hello'
1  2  3.0  b'World'

In [45]:
pd.DataFrame(data, index = ['first', 'second'])

        A    B         C
first   1  2.0  b'Hello'
second  2  3.0  b'World'

**From a list of dicts**